# UN Data Analysis

Analysis on UN Data comparing GDP per capita and internet usage

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline






Create three new data frames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab for auto-complete options).

Which country had the lowest percentage of internet users in 2014? What was the percentage?

Repeat for 2004 and 2009.

Which country had the highest gdp per capita in 2014? What was the gdp per capita?

Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

Create some scatterplots:
a. 2004 Percent Using the Internet vs GDP Per Capita
b. 2009 Percent Using the Internet vs GDP Per Capita
c. 2014 Percent Using the Internet vs GDP Per Capita

Are there differences across years? What do the plots tell you about any relationship between these two variables? Enter your observations as a markdown cell.

Look at the distribution of gdp per capita values for 2014. Is it unimodal?

Look at the distribution of Internet Use for 2014. Is it unimodal?

What are the top 5 countries in terms of internet use in 2014?

Create a data frame called top_5_internet from the combined data frame that has all three years for these 5 countries. You should have 15 rows. Check that this is true.

Create a seaborn FacetGrid to show the internet usage trend over time for these 5 countries (those with the highest reported internet use in 2014). Which country had the greatest growth between 2004 and 2014? Is there a plotting issue with Bermuda? Can you fix it?

Repeat the steps above to look at the trend for the 5 countries with the lowest 2014 internet usage. Which country has consistently had the least internet use?

Find the top 5 countries for 2014 in terms of GDP per capita; create a dataframe to look at 10-year trends in gdp per capita for those 5 countries. Use a seaborn facet grid for this.

Repeat this one more time to look at 10-year trend for the bottom 5 countries for 2014 in terms of GDP per capita.

Is there anything surprising or unusual in any of these plots? Searching on the internet, can you find any possible explanations for unusual findings?

Bonus exercise:
Download another data set from the UN data (http://data.un.org/Explorer.aspx) to merge with your data and explore.

In [7]:
## Load Data

In [9]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')

In [11]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN

In [26]:
internet_df = pd.read_csv('../data/internet_use.csv', nrows=4495)

In [27]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

# Look at the shape of each dataframe - how many rows, how many columns.

In [29]:
gdp_df.shape

(6731, 4)

In [30]:
internet_df.shape

(4495, 4)

### Take a look at the data types for the columns in each table.

In [37]:
type("Country or Area")

str

In [33]:
type("year")

str

In [34]:
type("value")

str

In [35]:
type('value footnotes')

str

In [39]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6731 entries, 0 to 6730
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6731 non-null   object
 1   Year             6731 non-null   object
 2   Value            6729 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 210.5+ KB

In [41]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

### Take a look at the last 10 rows of each dataset in turn.

In [49]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [50]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

### Drop the 'value footnotes' data (column) from both datasets. Check that this worked as expected.

In [52]:
del gdp_df["Value Footnotes"]

In [53]:
gdp_df.head()

  Country or Area  Year        Value
0     Afghanistan  2018  1734.723214
1     Afghanistan  2017  1758.465636
2     Afghanistan  2016  1757.023490
3     Afghanistan  2015  1766.593077
4     Afghanistan  2014  1795.735834

In [54]:
del internet_df['Value Footnotes']

In [55]:
internet_df.head(
)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

### 11.Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [60]:
gdp_df.columns=["Country","Year","GDP_Per_Capita"]

In [58]:
gdp_df.rename(columns = {'Country or Area':'Country'})

            Country                                      Year        Value
0       Afghanistan                                      2018  1734.723214
1       Afghanistan                                      2017  1758.465636
2       Afghanistan                                      2016  1757.023490
3       Afghanistan                                      2015  1766.593077
4       Afghanistan                                      2014  1795.735834
...             ...                                       ...          ...
6726       Zimbabwe                                      1992  2591.007534
6727       Zimbabwe                                      1991  2906.272849
6728       Zimbabwe                                      1990  2819.549467
6729  footnoteSeqID                                  Footnote          NaN
6730              2  Excludes South Sudan after July 9, 2011.          NaN

[6731 rows x 3 columns]

In [64]:
gdp_df=gdp_df.rename(columns = {'Value':"GDP_Per_Capita"})

### 12.Change the columns for the Internet Users data frame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [61]:
internet_df.columns=["Country","Year","Internet_Users_Pct"]

In [62]:
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

### 13. Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [63]:
gdp_df.append(internet_df)

          Country  Year  GDP_Per_Capita  Internet_Users_Pct
0     Afghanistan  2018     1734.723214                 NaN
1     Afghanistan  2017     1758.465636                 NaN
2     Afghanistan  2016     1757.023490                 NaN
3     Afghanistan  2015     1766.593077                 NaN
4     Afghanistan  2014     1795.735834                 NaN
...           ...   ...             ...                 ...
4490     Zimbabwe  1997             NaN            0.033080
4491     Zimbabwe  1996             NaN            0.016790
4492     Zimbabwe  1995             NaN            0.007684
4493     Zimbabwe  1994             NaN            0.001739
4494     Zimbabwe  1990             NaN            0.000000

[11226 rows x 4 columns]

### 14. 
Look at the first five rows of your new data frame to confirm it merged correctly.

### 15. Look at the last five rows to make sure the data is clean and as expected.

### 16.Subset the combined data frame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.